//
//  RandomElements.swift
//  PtichkinA_SurovtsevA_HW8
//
//  Created by Artur Sokolov on 18/08/2019.
//  Copyright © 2019 Артем. All rights reserved.
//

struct ModelElements {
    
    static let shared = ModelElements()
    
    let headsOrTails = ["Ⓞ", "Ⓟ"]
    let oneOfThree = ["🧱", "✂️", "📃"]
    let dice = ["⚀", "⚁", "⚂", "⚃", "⚄", "⚅"]
    let cards = ["A♤",
                 "2♤",
                 "3♤",
                 "4♤",
                 "5♤",
                 "6♤",
                 "7♤",
                 "8♤",
                 "9♤",
                 "10♤",
                 "J♤",
                 "Q♤",
                 "K♤",
                 "A♧",
                 "2♧",
                 "3♧",
                 "4♧",
                 "5♧",
                 "6♧",
                 "7♧",
                 "8♧",
                 "9♧",
                 "10♧",
                 "J♧",
                 "Q♧",
                 "K♧",
                 "A♡",
                 "2♡",
                 "3♡",
                 "4♡",
                 "5♡",
                 "6♡",
                 "7♡",
                 "8♡",
                 "9♡",
                 "10♡",
                 "J♡",
                 "Q♡",
                 "K♡",
                 "A♢",
                 "2♢",
                 "3♢",
                 "4♢",
                 "5♢",
                 "6♢",
                 "7♢",
                 "8♢",
                 "9♢",
                 "10♢",
                 "J♢",
                 "Q♢",
                 "K♢"]
}
